GREETINGS = """⚡ Привет, <b>дорогой друг</b>!

🤖 Это <b>Telegram-бот</b>, созданный пользователем @wfeels.

🔥 Здесь можно посмотреть все домашние задания 9 "П" класса, расписание каждого учебного дня и многое другое.

<b>📝 Домашнее задание:</b>
/menu - <i>главное меню</i>
/tomorrow - <i>домашние задания на завтра</i>
/calendar - <i>календарь домашних заданий</i>
/homework - <i> ВСЕ домашние задания</i>

<b>✨ Школьная жизнь:</b>
/schedule - <i>школьное расписание уроков на учебную неделю</i>
/timetable - <i>расписание звонков</i>
/teachers - <i>список учителей и их предметов</i>

<b>❗Помощь:</b>
/help - <i>справка по использованию бота</i>
/support - <i>поддержка</i>

<b>❓Другое:</b>
/donate - <i>поддержать автора бота</i>
/site - <i>веб-сайт электронного дневника</i>
/weather - <i>прогноз погоды на сегодня</i>"""

SUPPORT = """⚡ Со всеми вопросами и предложениями по разработке бота обращайтесь по контактам ниже:

Telegram - @wfeels
Email - danny.glazovs@gmail.com

<b><i>⏱ Если я не отвечаю, то нужно лишь время.</i></b>"""

SITE = """⚡Ссылка на сайт электронного дневника: 
https://petersburgedu.ru/ 

<b><i>❗Во время технического перерыва на сайте, вы всегда можете узнать \
домашнее задание через этого бота.</i></b>"""

DONATE = """⚡ Автору данного канала будет очень приятно, если вы отправите немножко денежных средств.

❗Полученные денежные средства будут использоваться для развития этого бота.

💰 <b>Перевод на карту Tinkoff</b>:
https://www.tinkoff.ru/rm/saburov.daniil23/TTzup21621
"""

SCHEDULE_DICTIONARY_RUS = {
    'monday': 'понедельник',
    'tuesday': 'вторник',
    'wednesday': 'среда',
    'thursday': 'четверг',
    'friday': 'пятница',
    'saturday': 'суббота',
}

TEACHERS = """⚡ Список учителей на 2023-2024 учебный год:

"""

TIMETABLE = """⚡ Расписание школьных звонков:

"""

TIMETABLE_ADVICE = """
❗Помни, что опоздание показывает <b>неуважение</b> к труду человека. 
Поэтому постарайся приходить на уроки <i>вовремя.</i>"""

HOMEWORK_TOMORROW_IS_NULL = """🎉 К счастью, на завтрашний день <b>нет</b> домашнего задания!

Прими теплую ванну и почитай книжку. Постарайся сегодня хорошо отдохнуть.

<b><i>⚡Удачи в грядущих делах! :)</i></b>"""

HOMEWORK_IS_NULL = """🎉 К счастью, на <i>{}</i> <b>нет</b> домашнего задания!

Не забывай, что не стоит откладывать дела, если у тебя есть возможность сделать их прямо сейчас :)

<b><i>⚡Удачи в грядущих делах! :)</i></b>"""

TEXT_ERROR = """⚡ Упс, произошла <b>ошибка!</b>
Не переживай, попробуй еще раз. 
Если ошибка повторяется, скорей напиши @wfeels."""

RANDOM_TEXT_FROM_USER = """<b>⚡ Упс, я тебя не понял!</b>

Кажется, ты говоришь на каком-то другом языке.

<i>Попробуй использовать команду /help, чтобы получше разобраться, как я работаю.</i>"""

WEATHER = """🔥 Хорошего дня и успехов в твоих покорениях!"""

CLEAR_SKY_WEATHER = """☀ Сегодня безоблачная погода.
Советую выйти на прогулку и насладиться чистым голубым небом.

<i>⚡Удачного отдыха! :)</i>"""

OVERCAST_CLOUDS_WEATHER = """☁ Сегодня пасмурная погода.
Будь аккуратен и помни, что здоровье на первом месте.

<i>⚡Удачного отдыха! :)</i>"""

FEW_CLOUDS_WEATHER = """🌤 Сегодня небольшая облачность.
Занимайся своими обычными делами и покоряй мечты.

<i>⚡Желаю удачи!</i>"""

SHOWER_RAIN_WEATHER = """🌧 Сегодня ливневый дождь.
Рекомендую сидеть дома и выполнять дела на следующую неделю.

<i>⚡Здоровье на первом месте. Старайся не заболеть в дождливые деньки.</i>"""

RAIN_WEATHER = """🌦 Сегодня намечается дождик.
Желаю удачи в повседневных делах.

<i>⚡Если выходишь на улицу, то оденься по-теплей!</i>"""

SNOW_WEATHER = """❄ Сегодня снег.
Обязательно поиграй со своими друзьями в снежки.
Не забудь слепить снеговика :)

<i>⚡Помни, что не нужно долго находиться на улице, чтобы не простыть.</i>"""

FALSE_PERMISSION = """⚡ К сожалению, Вам <b>закрыт</b> доступ к использованию этого бота. 
Обратитесь к <i>пользователю @wfeels</i> для дальнейших разбирательств."""

MESSAGE_TO_SEND = """⚡ Введите сообщение для отправки:"""
