GREETINGS = """⚡ Привет, <b>Админ!</b>

Этот бот создан для того, чтобы добавлять в базу данных дз.

<b>Команды бота</b>:

/add - <i>добавить дз</i>
/edit - <i>изменить дз</i>
"""

TEXT_TO_APPLY_HOMEWORK = """⚡ Все поля с данными о домашнем задании были успешно заполнены.

Убедитесь в правильном заполнении всех полей, перед отправкой.
Любая ошибка может привести к плохим последствиям.

Если Вы ВСЕ проверили, то можете смело нажимать кнопку для отправления данных."""

TEXT_TO_EDIT_HOMEWORK = """⚡ Вы можете обновить данные в любой момент, нужно лишь нажать на кнопку ниже.

Не забудьте перед обновлением данных все проверить.
Если уверены, что все верно, смело нажимайте на кнопку."""

TEXT_TO_DELETE_HOMEWORK = """⚡ Вы успешно удалили домашнее задание!"""

TEXT_ERROR1 = """⚡ Упс, произошла <b>ошибка!</b>
Здесь ничего нет :("""

TEXT_ERROR2 = """⚡ Упс, произошла <b>ошибка!</b>
Перепроверь все данные, которые ты ввел.
Возможно, ты неправильно указал предмет или описание. 
Если ошибка повторяется, скорей напиши @wfeels."""

TEXT_ERROR3 = """⚡ Упс, произошла <b>ошибка!</b>
Перепроверь все данные, которые ты ввел. 
Если ошибка повторяется, скорей напиши @wfeels."""

USERS_CHANGE_MENU = """⚡ Выберите действие из предложенного списка:"""

USERS_ID = """⚡ Введите ID пользователя:"""

